Tekla.Structures.Drawing.LinkBase
The LinkBase class is the base class for links.

Tekla.Structures.Drawing.LinkBase.InsertionPoint
Gets or sets the insertion point of the link.

Tekla.Structures.Drawing.LinkBase.Attributes
Gets or sets the link attributes.

Tekla.Structures.Drawing.LinkBase.Text
Gets or sets the link text that is visible on the screen.

Tekla.Structures.Drawing.LinkBase.Angle
Gets or sets the angle of the link.

Tekla.Structures.Drawing.LinkBase.MoveObjectRelative(Tekla.Structures.Geometry3d.Vector)
Moves the object according to the given move vector.
MoveVector: The move vector to be used.
Returns: True.

Tekla.Structures.Drawing.LinkBase.Resize(Tekla.Structures.Drawing.Size)
Resizes the object. The scaling type is changed to ScaleToFit.
size: The width and height to be used.
Returns: True.
Tekla.Structures.Drawing.ScalingOptions

Tekla.Structures.Drawing.LinkBase.GetAxisAlignedBoundingBox
Gets the bounding box for the current object in the global axis coordinate system.
Returns: A rectangle bounding box for the current object.

Tekla.Structures.Drawing.LinkBase.GetObjectAlignedBoundingBox
Gets the bounding box for the current object in its local coordinate system.
Returns: A rectangle bounding box for the current object.